## **Dados Utilizados nas Consultas - MER**

### Categorias de Vendas

In [7]:
import pandas as pd

df_categorias = pd.read_csv(r'C:\Users\jamil\OneDrive\Área de Trabalho\SQL\arquivos\categoria.csv')
df_categorias

   ID_CATEGORIA          NOME
0             1  Computadores
1             2   Periféricos
2             3    Acessórios

### Vendas

In [2]:
df_vendas = pd.read_csv(r'C:\Users\jamil\OneDrive\Área de Trabalho\SQL\arquivos\vendas.csv')
df_vendas

,ID_VENDA,DATA_VENDA,ID_LOJA,ID_DEPARTAMENTO,ID_CATEGORIA,QUANTIDADE,VALOR_TOTAL
0,1,2023-01-01,1,1,1,2,600.50
1,2,2023-01-02,1,2,2,1,150.00
2,3,2023-01-03,1,3,3,3,450.75
3,4,2023-01-04,1,1,2,2,320.20
4,5,2023-01-05,1,2,3,1,220.10
...,...,...,...,...,...,...,...
95,96,2023-04-26,2,3,3,3,800.00
96,97,2023-04-27,2,1,1,1,150.00
97,98,2023-04-28,2,2,2,2,400.00
98,99,2023-04-29,2,3,3,1,250.00
99,100,2023-04-30,2,1,1,3,500.00

### Estoque

In [3]:
df_estoque = pd.read_csv(r'C:\Users\jamil\OneDrive\Área de Trabalho\SQL\arquivos\estoque.csv')
df_estoque

    ID_ESTOQUE  ID_LOJA  ID_DEPARTAMENTO  ID_CATEGORIA  QUANTIDADE_DISPONÍVEL
0            1        1                1             1                     50
1            2        1                2             2                     30
2            3        1                3             3                     40
3            4        1                1             2                     25
4            5        1                2             3                     15
..         ...      ...              ...           ...                    ...
95          96        1                3             1                     55
96          97        2                1             2                     35
97          98        2                2             3                     50
98          99        2                3             1                     40
99         100        2                1             2                     45

[100 rows x 5 columns]

### Salarios por Departamentos

In [4]:
df_salario_departamentos = pd.read_csv(r'C:\Users\jamil\OneDrive\Área de Trabalho\SQL\arquivos\salarios.csv')
df_salario_departamentos

   ID_SAL_DEP  ID_DEPARTAMENTO  SALARIO_MEDIO
0           1                1         4500.0
1           2                2         3800.0
2           3                3         3200.0

## Lojas

In [5]:
df_lojas = pd.read_csv(r'C:\Users\jamil\OneDrive\Área de Trabalho\SQL\arquivos\lojas.csv')
df_lojas

   ID_LOJA     NOME_LOJA LOCALIZACAO
0        1  Loja Central      Centro
1        2    Loja Norte       Norte
2        3      Loja Sul         Sul

## **Definindo os Casos de Uso das Consultas:**

In [6]:
import pandas as pd
import duckdb


con = duckdb.connect()

result = con.execute("SELECT * FROM df_vendas").fetchdf()

result

,ID_VENDA,DATA_VENDA,ID_LOJA,ID_DEPARTAMENTO,ID_CATEGORIA,QUANTIDADE,VALOR_TOTAL
0,1,2023-01-01,1,1,1,2,600.50
1,2,2023-01-02,1,2,2,1,150.00
2,3,2023-01-03,1,3,3,3,450.75
3,4,2023-01-04,1,1,2,2,320.20
4,5,2023-01-05,1,2,3,1,220.10
...,...,...,...,...,...,...,...
95,96,2023-04-26,2,3,3,3,800.00
96,97,2023-04-27,2,1,1,1,150.00
97,98,2023-04-28,2,2,2,2,400.00
98,99,2023-04-29,2,3,3,1,250.00
99,100,2023-04-30,2,1,1,3,500.00

In [9]:
import pandas as pd
import duckdb


con = duckdb.connect()
con.register('df_vendas', df_vendas)
con.register('df_categorias', df_categorias)

query = """
    SELECT v.data_venda, v.valor_total, c.nome
    FROM df_vendas AS v
    JOIN df_categorias AS c ON v.id_categoria = c.id_categoria
"""

result = con.execute(query).fetchdf()

result

    DATA_VENDA  VALOR_TOTAL          NOME
0   2023-01-01       600.50  Computadores
1   2023-01-02       150.00   Periféricos
2   2023-01-03       450.75    Acessórios
3   2023-01-04       320.20   Periféricos
4   2023-01-05       220.10    Acessórios
..         ...          ...           ...
95  2023-04-26       800.00    Acessórios
96  2023-04-27       150.00  Computadores
97  2023-04-28       400.00   Periféricos
98  2023-04-29       250.00    Acessórios
99  2023-04-30       500.00  Computadores

[100 rows x 3 columns]

In [10]:
import pandas as pd
import duckdb


con = duckdb.connect()
con.register('df_vendas', df_vendas)
con.register('df_categorias', df_categorias)

query = """
    SELECT v.data_venda, v.valor_total, c.nome
    FROM df_vendas AS v
    JOIN df_categorias AS c ON v.id_categoria = c.id_categoria
    WHERE c.nome = 'Computadores' 
"""

result = con.execute(query).fetchdf()

result

    DATA_VENDA  VALOR_TOTAL          NOME
0   2023-01-01       600.50  Computadores
1   2023-01-06       890.00  Computadores
2   2023-01-09       540.90  Computadores
3   2023-01-12       700.00  Computadores
4   2023-01-15       900.75  Computadores
5   2023-01-16       650.00  Computadores
6   2023-01-21       400.00  Computadores
7   2023-01-24       450.00  Computadores
8   2023-01-27       250.00  Computadores
9   2023-01-30       300.00  Computadores
10  2023-02-03       250.00  Computadores
11  2023-02-05       700.00  Computadores
12  2023-02-08       150.00  Computadores
13  2023-02-11       600.00  Computadores
14  2023-02-14       300.00  Computadores
15  2023-02-16       500.00  Computadores
16  2023-02-19       800.00  Computadores
17  2023-03-02       300.00  Computadores
18  2023-03-05       350.00  Computadores
19  2023-03-08       150.00  Computadores
20  2023-03-11       800.00  Computadores
21  2023-03-14       700.00  Computadores
22  2023-03-16       250.00  Computadores
23  2023-03-19       450.00  Computadores
24  2023-04-02       300.00  Computadores
25  2023-04-05       800.00  Computadores
26  2023-04-06       200.00  Computadores
27  2023-04-09       750.00  Computadores
28  2023-04-12       700.00  Computadores
29  2023-04-15       250.00  Computadores
30  2023-04-18       300.00  Computadores
31  2023-04-21       500.00  Computadores
32  2023-04-27       150.00  Computadores
33  2023-04-30       500.00  Computadores

In [11]:
#Qual foi o valor total de Computadores vendidos?
import pandas as pd
import duckdb


con = duckdb.connect()
con.register('df_vendas', df_vendas)
con.register('df_categorias', df_categorias)

query = """
    SELECT c.nome, SUM(v.valor_total) AS total_vendas
    FROM df_vendas AS v
    JOIN df_categorias AS c ON v.id_categoria = c.id_categoria
    WHERE c.nome = 'Computadores'
    GROUP BY c.nome
"""

result = con.execute(query).fetchdf()

result

           NOME  total_vendas
0  Computadores      16432.15

In [14]:
#Quais foram as vendas de janeiro?

import pandas as pd
import duckdb


con = duckdb.connect()
con.register('df_vendas', df_vendas)
con.register('df_categorias', df_categorias)

query = """
    SELECT v.data_venda mes, SUM(v.valor_total) AS total_vendas
    FROM df_vendas AS v
    JOIN df_categorias AS c ON v.id_categoria = c.id_categoria
    WHERE c.nome = 'Computadores' and  v.data_venda between '2023-01-00' and '2023-01-30' 
    GROUP BY mes
    ORDER BY total_vendas DESC
"""

result = con.execute(query).fetchdf()

print(result)

          mes  total_vendas
0  2023-01-15        900.75
1  2023-01-06        890.00
2  2023-01-12        700.00
3  2023-01-16        650.00
4  2023-01-01        600.50
5  2023-01-09        540.90
6  2023-01-24        450.00
7  2023-01-21        400.00
8  2023-01-30        300.00
9  2023-01-27        250.00